vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
			if (s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket > dmx::max::CHANNELS) {
				s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket |= 0x8000;
				s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
				break;
			}
#if DMX_MAX_PORTS >= 5
			if (nPortIndex < 4) {
#endif
				nCounter = static_cast<uint16_t>(TIMER_CNT(TIMER2));
#if DMX_MAX_PORTS >= 5
			} else {
				nCounter = static_cast<uint16_t>(TIMER_CNT(TIMER3));
			}
#endif
			{
				const uint16_t nDelta = nCounter - sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious;
				sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = nCounter;
				const auto nPulse = static_cast<uint16_t>(nCounter + nDelta + 4);

				switch(nPortIndex){
				case 0:
					TIMER_CH0CV(TIMER2) = nPulse;
					break;
#if DMX_MAX_PORTS >= 2
				case 1:
					TIMER_CH1CV(TIMER2) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 3
				case 2:
					TIMER_CH2CV(TIMER2) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 4
				case 3:
					TIMER_CH3CV(TIMER2) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 5
				case 4:
					TIMER_CH0CV(TIMER3) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 6
				case 5:
					TIMER_CH1CV(TIMER3) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 7
				case 6:
					TIMER_CH2CV(TIMER3) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS == 8
				case 7:
					TIMER_CH3CV(TIMER3) = nPulse;
					break;
#endif
				default:
					assert(0);
					__builtin_unreachable();
					break;
				}
			}
			break;
		case TxRxState::RDMDATA: {
			nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
			s_RxBuffer[nPortIndex].data[nIndex] = data;
			s_RxBuffer[nPortIndex].Rdm.nIndex++;

			s_RxBuffer[nPortIndex].Rdm.nChecksum = static_cast<uint16_t>(s_RxBuffer[nPortIndex].Rdm.nChecksum + data);

			const auto *p = reinterpret_cast<struct TRdmMessage*>(&s_RxBuffer[nPortIndex].data[0]);

			nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;

			if ((nIndex >= 24) && (nIndex <= sizeof(struct TRdmMessage)) && (nIndex == p->message_length)) {
				s_RxBuffer[nPortIndex].State = TxRxState::CHECKSUMH;
			} else if (nIndex > sizeof(struct TRdmMessage)) {
				s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
			}
		}
		break;
		case TxRxState::CHECKSUMH:
			nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
			s_RxBuffer[nPortIndex].data[nIndex] = data;
			s_RxBuffer[nPortIndex].Rdm.nIndex++;
			s_RxBuffer[nPortIndex].Rdm.nChecksum = static_cast<uint16_t>(s_RxBuffer[nPortIndex].Rdm.nChecksum - static_cast<uint16_t>(data << 8));
			s_RxBuffer[nPortIndex].State = TxRxState::CHECKSUML;
			break;
		case TxRxState::CHECKSUML: {
			nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;
			s_RxBuffer[nPortIndex].data[nIndex] = data;
			s_RxBuffer[nPortIndex].Rdm.nIndex++;
			s_RxBuffer[nPortIndex].Rdm.nChecksum = static_cast<uint16_t>(s_RxBuffer[nPortIndex].Rdm.nChecksum - data);

			const auto *p = reinterpret_cast<struct TRdmMessage *>(&s_RxBuffer[nPortIndex].data[0]);

			if (!((s_RxBuffer[nPortIndex].Rdm.nChecksum == 0) && (p->sub_start_code == E120_SC_SUB_MESSAGE))) {
				s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket= 0; // This is correct.
			} else {
				s_RxBuffer[nPortIndex].Rdm.nIndex |= 0x4000;
				gv_RdmDataReceiveEnd = DWT->CYCCNT;
				logic_analyzer::ch1_clear();
			}

			s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
		}
		break;
		case TxRxState::RDMDISC:
			nIndex = s_RxBuffer[nPortIndex].Rdm.nIndex;

			if (nIndex < 24) {
				s_RxBuffer[nPortIndex].data[nIndex] = data;
				s_RxBuffer[nPortIndex].Rdm.nIndex++;
			}

#if DMX_MAX_PORTS >= 5
			if (nPortIndex < 4) {
#endif
				nCounter = static_cast<uint16_t>(TIMER_CNT(TIMER2));
#if DMX_MAX_PORTS >= 5
			} else {
				nCounter = static_cast<uint16_t>(TIMER_CNT(TIMER3));
			}
#endif
			{
				const uint16_t nDelta = nCounter - sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious;
				sv_nRxDmxPackets[nPortIndex].nTimerCounterPrevious = nCounter;
				const auto nPulse = static_cast<uint16_t>(nCounter + nDelta + 4);

				switch(nPortIndex){
				case 0:
					TIMER_CH0CV(TIMER2) = nPulse;
					break;
#if DMX_MAX_PORTS >= 2
				case 1:
					TIMER_CH1CV(TIMER2) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 3
				case 2:
					TIMER_CH2CV(TIMER2) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 4
				case 3:
					TIMER_CH3CV(TIMER2) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 5
				case 4:
					TIMER_CH0CV(TIMER3) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 6
				case 5:
					TIMER_CH1CV(TIMER3) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS >= 7
				case 6:
					TIMER_CH2CV(TIMER3) = nPulse;
					break;
#endif
#if DMX_MAX_PORTS == 8
				case 7:
					TIMER_CH3CV(TIMER3) = nPulse;
					break;
#endif
				default:
					assert(0);
					__builtin_unreachable();
					break;
				}
			}
			break;
		default:
			s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket= 0; // This is correct.
			s_RxBuffer[nPortIndex].State = TxRxState::IDLE;
			break;
	}

	logic_analyzer::ch0_clear();
}

extern "C" {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
#if defined (DMX_USE_USART0)
void USART0_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART0, config::USART0_PORT);
}
#endif
#if defined (DMX_USE_USART1)
void USART1_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART1, config::USART1_PORT);
}
#endif
#if defined (DMX_USE_USART2)
void USART2_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART2, config::USART2_PORT);
}
#endif
#if defined (DMX_USE_UART3)
void UART3_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART3, config::UART3_PORT);
}
#endif
#if defined (DMX_USE_UART4)
void UART4_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART4, config::UART4_PORT);
}
#endif
#if defined (DMX_USE_USART5)
void USART5_IRQHandler(void) {
	irq_handler_dmx_rdm_input(USART5, config::USART5_PORT);
}
#endif
#if defined (DMX_USE_UART6)
void UART6_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART6, config::UART6_PORT);
}
#endif
#if defined (DMX_USE_UART7)
void UART7_IRQHandler(void) {
	irq_handler_dmx_rdm_input(UART7, config::UART7_PORT);
}
#endif
#endif
}

static void timer1_config() {
	rcu_periph_clock_enable(RCU_TIMER1);
	timer_deinit(TIMER1);

	timer_parameter_struct timer_initpara;

	timer_initpara.prescaler = TIMER_PSC_1MHZ;
	timer_initpara.alignedmode = TIMER_COUNTER_EDGE;
	timer_initpara.counterdirection = TIMER_COUNTER_UP;
	timer_initpara.period = ~0;
	timer_initpara.clockdivision = TIMER_CKDIV_DIV1;
	timer_initpara.repetitioncounter = 0;
	timer_init(TIMER1, &timer_initpara);

	timer_flag_clear(TIMER1, ~0);
	timer_interrupt_flag_clear(TIMER1, ~0);

#if defined (DMX_USE_USART0)
	timer_channel_output_mode_config(TIMER1, TIMER_CH_0, TIMER_OC_MODE_ACTIVE);
	timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, ~0);
#endif

