vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
	dma_interrupt_flag_clear(DMA0, DMA_CH1, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
#endif
/*
 * UART 7
 */
#if defined (DMX_USE_UART7)
# if defined (GD32F20X)
void DMA1_Channel3_IRQHandler() {
	if (dma_interrupt_flag_get(DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA1, DMA_CH3, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART7_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART7_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART7_PORT].State = TxRxState::DMXINTER;
		}
	}

	dma_interrupt_flag_clear(DMA1, DMA_CH3, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
# if defined (GD32F4XX)
void DMA0_Channel0_IRQHandler() {
	if (dma_interrupt_flag_get(DMA0, DMA_CH0, DMA_INTERRUPT_FLAG_GET) == SET) {
		dma_interrupt_disable(DMA0, DMA_CH0, DMA_INTERRUPT_DISABLE);

		if (s_TxBuffer[dmx::config::UART7_PORT].outputStyle == dmx::OutputStyle::DELTA) {
			s_TxBuffer[dmx::config::UART7_PORT].State = TxRxState::IDLE;
		} else {
			timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3 , TIMER_CNT(TIMER4) + s_nDmxTransmitInterTime);
			s_TxBuffer[dmx::config::UART7_PORT].State = TxRxState::DMXINTER;
		}
	}

	dma_interrupt_flag_clear(DMA0, DMA_CH0, DMA_INTERRUPT_FLAG_CLEAR);
}
# endif
#endif
}

static void uart_dmx_config(uint32_t usart_periph) {
	gd32_uart_begin(usart_periph, 250000U, GD32_UART_BITS_8, GD32_UART_PARITY_NONE, GD32_UART_STOP_2BITS);
}

Dmx *Dmx::s_pThis = nullptr;

Dmx::Dmx() {
	DEBUG_ENTRY

	assert(s_pThis == nullptr);
	s_pThis = this;

	for (auto i = 0; i < DMX_MAX_PORTS; i++) {
#if !defined (GD32F4XX)
		gpio_init(s_DirGpio[i].nPort, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, s_DirGpio[i].nPin);
#else
		gpio_mode_set(s_DirGpio[i].nPort, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLDOWN, s_DirGpio[i].nPin);
		gpio_output_options_set(s_DirGpio[i].nPort, GPIO_OTYPE_PP, GPIO_OSPEED_50MHZ, s_DirGpio[i].nPin);
		gpio_af_set(s_DirGpio[i].nPort, GPIO_AF_0, s_DirGpio[i].nPin);
#endif
		ClearData(i);
		sv_PortState[i] = PortState::IDLE;
		SetPortDirection(i, PortDirection::INP, false);
		s_RxBuffer[i].State = TxRxState::IDLE;
		m_nDmxTransmissionLength[i] = dmx::max::CHANNELS;
		s_TxBuffer[i].State = TxRxState::IDLE;
		s_TxBuffer[i].outputStyle = dmx::OutputStyle::DELTA;
	}

	usart_dma_config();	// DMX Transmit
#if defined (DMX_USE_USART0) || defined (DMX_USE_USART1) || defined (DMX_USE_USART2) || defined (DMX_USE_UART3)
	timer1_config();	// DMX Transmit -> USART0, USART1, USART2, UART3
#endif
#if defined (DMX_USE_UART4) || defined (DMX_USE_USART5) ||  defined (DMX_USE_UART6) || defined (DMX_USE_UART7)
	timer4_config();	// DMX Transmit -> UART4, USART5, UART6, UART7
#endif
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	timer2_config();	// DMX Receive	-> Slot time-out Port 0,1,2,3
	timer3_config();	// DMX Receive	-> Slot time-out Port 4,5,6,7
	timer6_config();	// DMX Receive	-> Updates per second
#endif

#if defined (DMX_USE_USART0)
	uart_dmx_config(USART0);
	NVIC_EnableIRQ(USART0_IRQn);
#endif
#if defined (DMX_USE_USART1)
	uart_dmx_config(USART1);
	NVIC_EnableIRQ(USART1_IRQn);
#endif
#if defined (DMX_USE_USART2)
	uart_dmx_config(USART2);
	NVIC_EnableIRQ(USART2_IRQn);
#endif
#if defined (DMX_USE_UART3)
	uart_dmx_config(UART3);
	NVIC_EnableIRQ(UART3_IRQn);
#endif
#if defined (DMX_USE_UART4)
	uart_dmx_config(UART4);
	NVIC_EnableIRQ(UART4_IRQn);
#endif
#if defined (DMX_USE_USART5)
	uart_dmx_config(USART5);
	NVIC_EnableIRQ(USART5_IRQn);
#endif
#if defined (DMX_USE_UART6)
	uart_dmx_config(UART6);
	NVIC_EnableIRQ(UART6_IRQn);
#endif
#if defined (DMX_USE_UART7)
	uart_dmx_config(UART7);
	NVIC_EnableIRQ(UART7_IRQn);
#endif

	logic_analyzer::init();
	DEBUG_EXIT
}

void Dmx::SetPortDirection(uint32_t nPortIndex, PortDirection portDirection, bool bEnableData) {
	assert(nPortIndex < DMX_MAX_PORTS);

	const auto nUart = _port_to_uart(nPortIndex);

	if (m_dmxPortDirection[nPortIndex] != portDirection) {
		m_dmxPortDirection[nPortIndex] = portDirection;

		StopData(nUart, nPortIndex);

		if (portDirection == PortDirection::OUTP) {
			GPIO_BOP(s_DirGpio[nPortIndex].nPort) = s_DirGpio[nPortIndex].nPin;
		} else if (portDirection == PortDirection::INP) {
			GPIO_BC(s_DirGpio[nPortIndex].nPort) = s_DirGpio[nPortIndex].nPin;
		} else {
			assert(0);
		}
	} else if (!bEnableData) {
		StopData(nUart, nPortIndex);
	}

	if (bEnableData) {
		StartData(nUart, nPortIndex);
	}
}

void Dmx::ClearData(uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);
	auto *p = &s_TxBuffer[nPortIndex];
	auto *p16 = reinterpret_cast<uint16_t *>(p->data);

	for (auto i = 0; i < dmx::buffer::SIZE / 2; i++) {
		*p16++ = 0;
	}

	p->nLength = 513; // Including START Code
}

void Dmx::StartDmxOutput(const uint32_t nPortIndex) {
	assert(nPortIndex < dmx::config::max::OUT);
	const auto nUart = _port_to_uart(nPortIndex);

	switch (nUart) {
	/* TIMER 1 */
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_output(USART0_GPIO_PORT, USART0_TX_PIN);
		GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_0, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER1, TIMER_INT_CH0);
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_output(USART1_GPIO_PORT, USART1_TX_PIN);
		GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER1, TIMER_INT_CH1);
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_output(USART2_GPIO_PORT, USART2_TX_PIN);
		GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER1, TIMER_INT_CH2);
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_output(UART3_GPIO_PORT, UART3_TX_PIN);
		GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, TIMER_CNT(TIMER1) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER1, TIMER_INT_CH3);
		break;
#endif
		/* TIMER 4 */
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_output(UART4_GPIO_TX_PORT, UART4_TX_PIN);
		GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_0, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER4, TIMER_INT_CH0);
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_output(USART5_GPIO_PORT, USART5_TX_PIN);
		GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER4, TIMER_INT_CH1);
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_output(UART6_GPIO_PORT, UART6_TX_PIN);
		GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_2, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER4, TIMER_INT_CH2);
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_output(UART7_GPIO_PORT, UART7_TX_PIN);
		GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
		timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, TIMER_CNT(TIMER4) + s_nDmxTransmitBreakTime);
		timer_interrupt_enable(TIMER4, TIMER_INT_CH3);
		break;
#endif
	default:
		assert(0);
		break;
	}

	s_TxBuffer[nPortIndex].State = TxRxState::BREAK;
}

void Dmx::StartOutput(const uint32_t nPortIndex) {
	if ((sv_PortState[nPortIndex] == dmx::PortState::TX) && (s_TxBuffer[nPortIndex].outputStyle == dmx::OutputStyle::DELTA)) {
		StartDmxOutput(nPortIndex);
	}
}

static bool s_doForce;

