vanvught/GD32F407RE-DMX512-RDM/lib-dmx/src/gd32/dmx.cpp
void Dmx::SetDmxSlots(uint16_t nSlots) {
	if ((nSlots >= 2) && (nSlots <= dmx::max::CHANNELS)) {
		m_nDmxTransmitSlots = nSlots;

		for (uint32_t i = 0; i < config::max::OUT; i++) {
			m_nDmxTransmissionLength[i] = std::min(m_nDmxTransmissionLength[i], static_cast<uint32_t>(nSlots));
		}

		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetSendData(uint32_t nPortIndex, const uint8_t *pData, uint32_t nLength) {
	assert(nPortIndex < DMX_MAX_PORTS);

	auto *p = &s_TxBuffer[nPortIndex];
	auto *pDst = p->data;

	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->nLength = static_cast<uint16_t>(nLength + 1);

	memcpy(pDst, pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPortIndex]) {
		m_nDmxTransmissionLength[nPortIndex] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}
}

void Dmx::SetPortSendDataWithoutSC(__attribute__((unused)) uint32_t nPortIndex, __attribute__((unused)) const uint8_t *pData, __attribute__((unused)) uint32_t nLength) {
	logic_analyzer::ch4_set();
	assert(nPortIndex < DMX_MAX_PORTS);

	auto *p = &s_TxBuffer[nPortIndex];
	auto *pDst = p->data;

	nLength = std::min(nLength, static_cast<uint32_t>(m_nDmxTransmitSlots));
	p->nLength = static_cast<uint16_t>(nLength + 1);

	pDst[0] = START_CODE;
	memcpy(&pDst[1], pData,  nLength);

	if (nLength != m_nDmxTransmissionLength[nPortIndex]) {
		m_nDmxTransmissionLength[nPortIndex] = nLength;
		SetDmxPeriodTime(m_nDmxTransmitPeriodRequested);
	}

	logic_analyzer::ch4_clear();
}

void Dmx::Blackout() {
	DEBUG_ENTRY

	for (uint32_t nPortIndex = 0; nPortIndex < DMX_MAX_PORTS; nPortIndex++) {
		if (m_dmxPortDirection[nPortIndex] == dmx::PortDirection::OUTP) {
			const auto nUart = _port_to_uart(nPortIndex);

			StopData(nUart, nPortIndex);
			ClearData(nPortIndex);
			StartData(nUart, nPortIndex);
		}
	}

	DEBUG_EXIT
}

void Dmx::FullOn() {
	DEBUG_ENTRY

	for (uint32_t nPortIndex = 0; nPortIndex < DMX_MAX_PORTS; nPortIndex++) {
		if (m_dmxPortDirection[nPortIndex] == dmx::PortDirection::OUTP) {
			const auto nUart = _port_to_uart(nPortIndex);

			StopData(nUart, nPortIndex);

			auto *p = &s_TxBuffer[nPortIndex];
			auto *p16 = reinterpret_cast<uint16_t*>(p->data);

			for (auto i = 0; i < dmx::buffer::SIZE / 2; i++) {
				*p16++ = UINT16_MAX;
			}

			p->data[0] = dmx::START_CODE;

			StartData(nUart, nPortIndex);
		}
	}

	DEBUG_EXIT
}

// DMX Receive

const uint8_t* Dmx::GetDmxChanged(UNUSED uint32_t nPortIndex) {
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	const auto *p = GetDmxAvailable(nPortIndex);

	if (p == nullptr) {
		return nullptr;
	}

	const auto *pSrc16 = reinterpret_cast<const uint16_t*>(p);
	auto *pDst16 = reinterpret_cast<uint16_t *>(&s_RxDmxPrevious[nPortIndex][0]);

	auto isChanged = false;

	for (auto i = 0; i < buffer::SIZE / 2; i++) {
		if (*pDst16 != *pSrc16) {
			*pDst16 = *pSrc16;
			isChanged = true;
		}
		pDst16++;
		pSrc16++;
	}

	return (isChanged ? p : nullptr);
#else
	return nullptr;
#endif
}

const uint8_t *Dmx::GetDmxAvailable(UNUSED uint32_t nPortIndex)  {
	assert(nPortIndex < DMX_MAX_PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	if ((s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket & 0x8000) != 0x8000) {
		return nullptr;
	}

	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket &= ~0x8000;
	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket--;	// Remove SC from length

	return s_RxBuffer[nPortIndex].data;
#else
	return nullptr;
#endif
}

const uint8_t* Dmx::GetDmxCurrentData(uint32_t nPortIndex) {
	return s_RxBuffer[nPortIndex].data;
}

uint32_t Dmx::GetUpdatesPerSecond(UNUSED uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	__DMB();
	return sv_nRxDmxPackets[nPortIndex].nPerSecond;
#else
	return 0;
#endif
}

uint32_t GetDmxReceivedCount(UNUSED uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);
#if !defined(CONFIG_DMX_TRANSMIT_ONLY)
	__DMB();
	return sv_nRxDmxPackets[nPortIndex].nCount;
#else
	return 0;
#endif
}

// RDM Send

void Dmx::RdmSendRaw(uint32_t nPortIndex, const uint8_t* pRdmData, uint32_t nLength) {
	assert(nPortIndex < DMX_MAX_PORTS);
	assert(pRdmData != nullptr);
	assert(nLength != 0);

	const auto nUart = _port_to_uart(nPortIndex);

	while (SET != usart_flag_get(nUart, USART_FLAG_TC))
		;

	switch (nUart) {
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_output(USART0_GPIO_PORT, USART0_TX_PIN);
		GPIO_BC(USART0_GPIO_PORT) = USART0_TX_PIN;
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_output(USART1_GPIO_PORT, USART1_TX_PIN);
		GPIO_BC(USART1_GPIO_PORT) = USART1_TX_PIN;
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_output(USART2_GPIO_PORT, USART2_TX_PIN);
		GPIO_BC(USART2_GPIO_PORT) = USART2_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_output(UART3_GPIO_PORT, UART3_TX_PIN);
		GPIO_BC(UART3_GPIO_PORT) = UART3_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_output(UART4_GPIO_TX_PORT, UART4_TX_PIN);
		GPIO_BC(UART4_GPIO_TX_PORT) = UART4_TX_PIN;
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_output(USART5_GPIO_PORT, USART5_TX_PIN);
		GPIO_BC(USART5_GPIO_PORT) = USART5_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_output(UART6_GPIO_PORT, UART6_TX_PIN);
		GPIO_BC(UART6_GPIO_PORT) = UART6_TX_PIN;
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_output(UART7_GPIO_PORT, UART7_TX_PIN);
		GPIO_BC(UART7_GPIO_PORT) = UART7_TX_PIN;
		break;
#endif
	default:
		assert(0);
		__builtin_unreachable();
		break;
	}

	udelay(RDM_TRANSMIT_BREAK_TIME);

	switch (nUart) {
#if defined (DMX_USE_USART0)
	case USART0:
		_gpio_mode_af(USART0_GPIO_PORT, USART0_TX_PIN, USART0);
		break;
#endif
#if defined (DMX_USE_USART1)
	case USART1:
		_gpio_mode_af(USART1_GPIO_PORT, USART1_TX_PIN, USART1);
		break;
#endif
#if defined (DMX_USE_USART2)
	case USART2:
		_gpio_mode_af(USART2_GPIO_PORT, USART2_TX_PIN, USART2);
		break;
#endif
#if defined (DMX_USE_UART3)
	case UART3:
		_gpio_mode_af(UART3_GPIO_PORT, UART3_TX_PIN, UART3);
		break;
#endif
#if defined (DMX_USE_UART4)
	case UART4:
		_gpio_mode_af(UART4_GPIO_TX_PORT, UART4_TX_PIN, UART4);
		break;
#endif
#if defined (DMX_USE_USART5)
	case USART5:
		_gpio_mode_af(USART5_GPIO_PORT, USART5_TX_PIN, USART5);
		break;
#endif
#if defined (DMX_USE_UART6)
	case UART6:
		_gpio_mode_af(UART6_GPIO_PORT, UART6_TX_PIN, UART6);
		break;
#endif
#if defined (DMX_USE_UART7)
	case UART7:
		_gpio_mode_af(UART7_GPIO_PORT, UART7_TX_PIN, UART7);
		break;
#endif
	default:
		assert(0);
		__builtin_unreachable();
		break;
	}

	udelay(RDM_TRANSMIT_MAB_TIME);

	for (uint32_t i = 0; i < nLength; i++) {
		while (RESET == usart_flag_get(nUart, USART_FLAG_TBE))
			;
		USART_DATA(nUart) = static_cast<uint16_t>(USART_DATA_DATA & pRdmData[i]);
	}

	while (SET != usart_flag_get(nUart, USART_FLAG_TC)) {
		static_cast<void>(GET_BITS(USART_DATA(nUart), 0U, 8U));
	}
}

// RDM Receive

const uint8_t *Dmx::RdmReceive(uint32_t nPortIndex) {
	assert(nPortIndex < DMX_MAX_PORTS);

	if ((s_RxBuffer[nPortIndex].Rdm.nIndex & 0x4000) != 0x4000) {
		return nullptr;
	}

	s_RxBuffer[nPortIndex].Dmx.nSlotsInPacket = 0; // This is correct.
	return s_RxBuffer[nPortIndex].data;
}

const uint8_t *Dmx::RdmReceiveTimeOut(uint32_t nPortIndex, uint16_t nTimeOut) {
	assert(nPortIndex < DMX_MAX_PORTS);

	uint8_t *p = nullptr;
	TIMER_CNT(TIMER5) = 0;

	do {
		if ((p = const_cast<uint8_t*>(RdmReceive(nPortIndex))) != nullptr) {
			return p;
		}
	} while (TIMER_CNT(TIMER5) < nTimeOut);

	return nullptr;
}
